; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v7 - type_3 ?v2 - type_1)
 	      (pred_4 ?v4 - object ?v2 - type_1)
	      (pred_2 ?v7 - type_3 ?v8 - type_2)
	      (pred_1 ?v7 - type_3 ?v4 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v7 - type_3 ?v6 ?v5 - type_1)
       :precondition (and  (pred_3 ?v7 ?v6))
       :effect (and  (pred_3 ?v7 ?v5)
		     (not (pred_3 ?v7 ?v6))))

   (:action op_1
       :parameters (?v7 - type_3 ?v3 - object ?v1 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v1) (pred_3 ?v7 ?v1) (pred_2 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v3 ?v8)
		    (not (pred_4 ?v3 ?v1)) 
		    (not (pred_2 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_3 ?v3 - object ?v1 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v3 ?v8) (pred_3 ?v7 ?v1))
       :effect (and (pred_4 ?v3 ?v1)
		    (pred_2 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v3 ?v8)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_05 obj_10 - type_3
obj_03 obj_04 obj_09 obj_02 - type_2
obj_06 obj_08 obj_07 - type_1
obj_01 obj_11 - object)
(:init
(pred_3 obj_05 obj_08)
(pred_2 obj_05 obj_03)
(pred_2 obj_05 obj_04)
(pred_3 obj_10 obj_07)
(pred_2 obj_10 obj_09)
(pred_2 obj_10 obj_02)
(pred_4 obj_01 obj_08)
(pred_4 obj_11 obj_08)
)
(:goal
(and
(pred_4 obj_01 obj_07)
(pred_4 obj_11 obj_08)
)
)

(:constraints
  (always (not (pred_3 obj_05 obj_07)))
)
)

; plan
1. (op_2 obj_10 obj_07 obj_08)
   deleted: (pred_3 obj_10 obj_07)
   added: (pred_3 obj_10 obj_08)
   goals met: 1 of 2
2. (op_1 obj_10 obj_01 obj_08 obj_02)
   deleted: (pred_4 obj_01 obj_08) (pred_2 obj_10 obj_02)
   added: (pred_1 obj_10 obj_01 obj_02)
   goals met: 1 of 2
3. (op_2 obj_10 obj_08 obj_07)
   deleted: (pred_3 obj_10 obj_08)
   added: (pred_3 obj_10 obj_07)
   goals met: 1 of 2
4. (op_3 obj_10 obj_01 obj_07 obj_02)
   deleted: (pred_1 obj_10 obj_01 obj_02)
   added: (pred_4 obj_01 obj_07) (pred_2 obj_10 obj_02)
   goals met: 2 of 2
